app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all

INSERT INTO "videos" ("title", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "here is vedio funny cat"], ["file", "Little_Kitten_Playing_His_Toy_Mouse.mp4"], ["created_at", "2022-04-26 09:41:06.092074"], ["updated_at", "2022-04-26 09:41:06.092074"]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "file" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["file", "virat_kohli_six_status____short__tranding.mp4"], ["updated_at", "2022-04-26 10:00:50.570221"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @video.update(video_params)

DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 1]]
---
  def destroy
    @video.destroy

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_video
      @video = Video.find(params[:id])